Repository: FitimZulfiju/Ai-CV-application-generator
Catalog: AiCV.Infrastructure/Resources/AicvResources.*.resx
Languages: sq

source: Settings
sq: Cilësimet

source: OpenRouter API Key
sq: Çelësi i API për OpenRouter

source: Default Model
sq: Modeli i Paracaktuar

source: Save Settings
sq: Ruaj Cilësimet

# SettingsTitle
source: Settings
sq: Cilësimet

# UseOpenRouter
source: Use OpenRouter for dynamic model selection
sq: Përdorni OpenRouter për përzgjedhjen dinamike të modelit

# ModelDiscoveryHelper
source: OpenRouter key allows you to discover and use any available LLM.
sq: Çelësi i OpenRouter ju lejon të zbuloni dhe përdorni çdo LLM të disponueshëm.

# WelcomeMessage
source: Welcome to CV & Cover Letter Generator
sq: Mirë se vini në Gjeneratorin e CV-së dhe Letrës Shoqëruese

source: Manage Profile
sq: Menaxho Profilin

source: Generate Application
sq: Gjenero Aplikimin

source: View Sample CV
sq: Shiko Shembull të CV-së

source: Go to Profile
sq: Shko te Profili

source: Start Generating
sq: Fillo Gjenerimin

source: How it Works
sq: Si Funksionon

source: Job Details
sq: Detajet e Punës

source: Model
sq: Modeli

source: Company Name
sq: Emri i Kompanisë

source: Job Title
sq: Titulli i Punës

source: Manual Entry Mode
sq: Mënyra e Futjes Manuale

source: Job URL
sq: URL e Punës

source: Fetch
sq: Merre

# MarkdownEditor
source: Editor (Markdown)
sq: Redaktori (Markdown)

source: Job Description
sq: Përshkrimi i Punës

source: Preview (HTML)
sq: Parashikimi (HTML)

# CustomInstructions
source: Custom Instructions (Optional)
sq: Udhëzime të Personalizuara (Opsionale)

source: Split
sq: Ndarja

source: Generated Content
sq: Përmbajtja e Gjeneruar

source: Visual Preview
sq: Parashikimi Vizual

source: Copy
sq: Kopjo

source: Print
sq: Printo

source: Save
sq: Ruaj

source: Saved
sq: U Ruajt

# CoverLetterAndApplication
source: Cover Letter & Application
sq: Letra Shoqëruese & Aplikimi

source: Tailored CV
sq: CV e Përshtatur

source: Application Email
sq: Email i Aplikimit

source: Generating...
sq: Duke u gjeneruar...

source: Fetching...
sq: Duke u marrë...

source: Master CV Profile
sq: Profili Kryesor i CV-së

source: Formatting Help
sq: Ndihmë për Formatimin

source: Personal Details
sq: Detajet Personale

source: Upload Picture
sq: Ngarko Fotografi

source: Professional Title
sq: Titulli Profesional

source: Professional Summary
sq: Përmbledhja Profesionale

source: Experience
sq: Përvoja

source: Add Experience
sq: Shto Përvojë

source: Company
sq: Kompania

source: Start Date
sq: Data e Fillimit

source: End Date
sq: Data e Përfundimit

source: Current Role
sq: Roli Aktual

source: Education
sq: Edukimi

source: Add Education
sq: Shto Edukim

source: Institution
sq: Institucioni

source: Degree
sq: Diploma/Titulli

source: Skills
sq: Aftësitë

source: Add Category
sq: Shto Kategori

source: Category Name
sq: Emri i Kategorisë

source: Add Skill
sq: Shto Aftësi

source: Projects
sq: Projektet

source: Add Project
sq: Shto Projekt

source: Project Name
sq: Emri i Projektit

source: Technologies Used
sq: Teknologjitë e Përdorura

source: Link (GitHub/Live)
sq: Linku (GitHub/Live)

source: Languages
sq: Gjuhët

source: Add Language
sq: Shto Gjuhë

source: Proficiency
sq: Aftësia

source: Interests
sq: Interesat

source: Add Interest
sq: Shto Interes

source: CV Preview
sq: Parashikimi i CV-së

# FormattingHelpTitle
source: Text Formatting Help
sq: Ndihmë për Formatimin e Tekstit

source: Line Breaks
sq: Ndarjet e Rreshtave

source: Bullet Points
sq: Pikat (Bullets)

source: HTML Tags
sq: Etiketat HTML

source: Got it!
sq: E kuptova!

source: Albanian Only
sq: Vetëm Shqip

# CostDisclaimer
source: Your AI provider API keys are linked to your personal accounts (OpenRouter, OpenAI, etc.). Usage costs will be billed directly to you by those providers based on your consumption.
sq: Celesat e API-se tuaj lidhen me llogarite tuaja personale (OpenRouter, OpenAI, etj.). Kostot e perdorimit do te faturohen direkt nga ata ofrues bazuar ne konsumin tuaj.

source: Configured Models
sq: Modelet e Konfiguruara

# NoConfigurationsYet
source: No AI models have been configured yet.
sq: Asnjë model AI nuk është konfiguruar ende.

source: Models
sq: Modelet

source: OpenRouter Model
sq: Modeli i OpenRouter

source: Add Configuration
sq: Shto Konfigurim

source: Provider
sq: Ofruesi

source: Validate
sq: Valido

source: Active
sq: Aktiv

source: Set as Active
sq: Vendos si Aktiv

# ActiveConfigChanged
source: Active configuration changed to {0}
sq: Konfigurimi aktiv u ndryshua në {0}

# ConfigurationUpdated
source: Configuration updated successfully
sq: Konfigurimi u përditësua me sukses

# ConfigurationDeleted
source: Configuration deleted successfully
sq: Konfigurimi u fshi me sukses

source: Delete Configuration
sq: Fshi Konfigurimin

# DeleteConfigConfirmation
source: Are you sure you want to delete this configuration?
sq: A jeni i sigurt që dëshironi të fshini këtë konfigurim?

# ConfigurationSaved
source: Configuration saved successfully
sq: Konfigurimi u ruajt me sukses

source: Edit Configuration
sq: Ndrysho Konfigurimin

source: Configuration Name
sq: Emri i Konfigurimit

source: API Key
sq: Çelësi API

source: Cancel
sq: Anulo

source: Delete
sq: Fshi

source: Name
sq: Emri

source: Welcome to
sq: Mirë se vini në

# CvAndCoverLetter
source: CV & Cover Letter
sq: Gjenerator i

source: Generator
sq: CV & Letër Motivimi

# AiPoweredCareerAssistant
source: Your AI-powered career assistant.
sq: Asistenti juaj i karrierës i fuqizuar nga AI.

source: Developed by
sq: Zhvilluar nga

# EnterJobDetailsForCoverLetter
source: Enter job details and click Generate to create a cover letter.
sq: Vendosni detajet e punës dhe klikoni Gjenero për të krijuar një letër motivimi.

# EnterJobDetailsForCv
source: Enter job details and click Generate to create a tailored CV.
sq: Vendosni detajet e punës dhe klikoni Gjenero për të krijuar një CV të personalizuar.

# EnterJobDetailsForEmail
source: Enter job details and click Generate to create an application email.
sq: Vendosni detajet e punës dhe klikoni Gjenero për të krijuar një email aplikimi.

# NoApplicationsYet
source: You haven't generated any applications yet. Go to
sq: Nuk keni krijuar ende asnjë aplikim. Shkoni te

source: to create one!
sq: për të krijuar një!

source: Date
sq: Data

source: View
sq: Shiko

source: Admin Dashboard
sq: Paneli i Administratorit

source: Export CSV
sq: Eksporto CSV

source: Total Users
sq: Totali i Përdoruesve

source: Profiles Created
sq: Profile të Krijuara

source: Applications Generated
sq: Aplikime të Gjeneruara

source: System Logs
sq: Regjistrat e Sistemit

source: Clear Old Logs
sq: Pastro Regjistrat e Vjetër

source: Refresh
sq: Rifresko

source: Log Entries
sq: Hyrjet e Regjistrit

source: All Levels
sq: Të Gjitha Nivelet

source: Error
sq: Gabim

source: Warning
sq: Paralajmërim

source: Info
sq: Informacion

source: Timestamp
sq: Koha

source: Level
sq: Niveli

source: Message
sq: Mesazhi

source: Source
sq: Burimi

source: Path
sq: Rruga

source: User
sq: Përdoruesi

source: Anonymous
sq: Anonim

source: Home
sq: Kryefaqja

source: Profile
sq: Profili

source: Logged in as
sq: Kyçur si

source: Logout
sq: Dil

source: Login
sq: Kyçu

source: Register
sq: Regjistrohu

# ProfileCardDescription
source: Update your Master CV, experience, education, and skills. This is the source of truth for all your applications.
sq: Përditësoni CV-në tuaj kryesore, përvojën, arsimin dhe aftësitë. Kjo është burimi i vërtetë për të gjitha aplikimet tuaja.

# GenerateCardDescription
source: Paste a job description and let AI tailor a cover letter and resume specifically for that role.
sq: Vendosni një përshkrim pune dhe lini AI-në të krijojë një letër motivimi dhe CV të personalizuar për atë rol.

# SampleCvCardDescription
source: See an example of a complete, well-filled CV profile. Use it as a reference when building your own.
sq: Shikoni një shembull të një profili CV të plotë dhe të mirëmbushur. Përdoreni si referencë kur ndërtoni tuajin.

source: Portfolio URL
sq: URL e Portofolios

# EducationDescriptionHelper
source: e.g. Ministry Recognition, Honors, Thesis
sq: p.sh. Njohja nga Ministria, Nderime, Teza

# SkillsHelper
source: Add skill categories and skills. Click the chip's X to remove a skill.
sq: Shtoni kategori aftësish dhe aftësi. Klikoni X-in e çipit për të hequr një aftësi.

# ProjectSectionTitleHelper
source: First line = section header (e.g. 'AI-Enabled Analytics Module'), following lines = bullet points
sq: Linja e parë = koka e seksionit (p.sh. 'Moduli i Analitikës së mundësuar nga AI'), linjat pasuese = pika (bullet points)

# LanguageProficiencyHelper
source: e.g. Native, Fluent, Intermediate
sq: p.sh. Amtare, rrjedhshëm, mesatare

source: Field
sq: Fusha

# FormattingHelpDescription
source: Different fields support different formatting. See details below.
sq: Fusha të ndryshme mbështesin formatime të ndryshme. Shihni detajet më poshtë.

# LineBreaksDescription
source: Each new line in your text becomes a separate line or bullet point.
sq: Çdo linjë e re në tekstin tuaj bëhet një linjë e veçantë ose pikë (bullet point).

# BulletPointsDescription
source: Start lines with - or * to create bullet points.
sq: Filloni linjat me - ose * për të krijuar pika (bullet points).

# HtmlTagsDescription
source: You can use HTML directly for styling.
sq: Ju mund të përdorni HTML direkt për stilim.

source: Where Each Format Works
sq: Ku Funksionon Çdo Format

source: Yes
sq: Po

source: No
sq: Jo

source: as bullets
sq: si pika

source: Experience Description
sq: Përshkrimi i Përvojës

source: Project Description
sq: Përshkrimi i Projektit

source: Education Description
sq: Përshkrimi i Edukimit

source: This Month
sq: Këtë Muaj

source: Applications - Last 30 Days
sq: Aplikimet - 30 Ditët e Fundit

source: Top Users
sq: Përdoruesit Kryesorë

# NoApplicationsYetSimple
source: No applications yet
sq: Asnjë aplikim ende

source: Activity Overview
sq: Përmbledhja e Aktivitetit

source: Today
sq: Sot

source: This Week
sq: Këtë Javë

source: System Overview
sq: Përmbledhja e Sistemit

source: Users
sq: Përdoruesit

source: Profiles
sq: Profilet

source: Applications
sq: Aplikimet

source: User Management
sq: Menaxhimi i Përdoruesve

# UsersCountSuffix
source: users
sq: përdorues

source: Status
sq: Statusi

source: Full Name
sq: Emri i Plotë

source: Roles
sq: Rolet

source: API Keys
sq: Çelësat API

source: Actions
sq: Veprimet

source: Locked
sq: I Bllokuar

source: Unlock
sq: Zhblloko

source: Lock
sq: Blloko

source: Recent Applications
sq: Aplikimet e Fundit

source: Application not found.
sq: Aplikimi nuk u gjet.

source: Back to List
sq: Kthehu te Lista

source: Print CV
sq: Printo CV

source: Cover Letter
sq: Letra e Motivimit

source: Unable to load cover letter.
sq: Nuk mund të ngarkohet letra e motivimit.

source: Unable to load tailored CV.
sq: Nuk mund të ngarkohet CV-ja e përshtatur.

source: Copy Email
sq: Kopjo Email-in

# NoApplicationEmailSaved
source: No application email was saved for this application.
sq: Nuk është ruajtur asnjë email aplikimi për këtë aplikim.

source: User ID
sq: ID e Përdoruesit

source: Stack Trace
sq: Gjurma e Gabimit

source: Close
sq: Mbyll

# LoginTitle
source: Ai-CV Login
sq: Ai-CV Hyrja

source: Remember Me
sq: Më kujto

source: Or sign in with
sq: Ose hyni me

source: Continue with Google
sq: Vazhdo me Google

source: Continue with Microsoft
sq: Vazhdo me Microsoft

source: Continue with GitHub
sq: Vazhdo me GitHub

# DontHaveAccount
source: Don't have an account?
sq: Nuk keni llogari?

source: Register here
sq: Regjistrohuni këtu

source: Create Account
sq: Krijo Llogari

source: Confirm Password
sq: Konfirmo Fjalëkalimin

# AlreadyHaveAccount
source: Already have an account?
sq: Keni llogari?

source: Login here
sq: Hyni këtu

# PasswordRequirementHelper
source: Minimum 6 characters, at least one uppercase, lowercase, and digit
sq: Minimumi 6 karaktere, të paktën një shkronjë të madhe, të vogël dhe një shifër

source: How It Works & Guide
sq: Si Funksionon & Guida

source: Step 1
sq: Hapi 1

source: Build Master CV
sq: Ndërtoni CV-në Master

# BuildMasterCvDescription
source: Go to the Profile page and fill in your details. This is your "Source of Truth" - add everything you've ever done.
sq: Shkoni te faqja e Profilit dhe plotësoni detajet tuaja. Ky është "Burimi i së Vërtetës" - shtoni çdo gjë që keni bërë ndonjëherë.

source: Step 2
sq: Hapi 2

source: Connect AI Keys
sq: Lidhni Çelësat AI

# ConnectAiKeysDescription
source: Ensure your API keys (OpenAI, Gemini, etc.) are set in Settings. The app needs these to generate content.
sq: Sigurohuni që çelësat tuaj API (OpenAI, Gemini, etj.) janë vendosur te Cilësimet. Aplikacioni ka nevojë për këto për të gjeneruar përmbajtje.

source: Step 3
sq: Hapi 3

# GenerateApplicationDescription
source: Go to Generate, paste a Job URL or description. The AI will read your Master CV and the Job Description to create a perfectly tailored Resume and Cover Letter.
sq: Shkoni te Gjenero, ngjitni një URL të punës ose përshkrimin. AI do të lexojë CV-në tuaj Master dhe Përshkrimin e Punës për të krijuar një CV dhe Letër Motivimi të përshtatur në mënyrë perfektë.

source: HTML Formatting
sq: Formatimi HTML

# HtmlFormattingDescription
source: You can use HTML tags in Description fields (Summary, Work Experience, etc.) to format your text.
sq: Ju mund të përdorni etiketat HTML në fushat e Përshkrimit (Përmbledhja, Përvoja e Punës, etj.) për të formatuar tekstin tuaj.

source: Code to Write
sq: Kodi Për të Shkruar

source: Result Preview
sq: Parapamja e Rezultatit

source: Installing updates...
sq: Duke instaluar përditësimet...

source: Update Available
sq: Përditësim i Disponueshëm

# ServerRestartingWait
source: The server is restarting. Please wait...
sq: Serveri po riniset. Ju lutem pritni...

# ImprovingSystemWorkSavedRestart
source: We are improving the system. Your work is saved locally. Brief restart in {0}.
sq: Ne po përmirësojmë sistemin. Puna juaj është ruajtur lokalisht. Rinisje e shkurtër në {0}.

source: Bold Text
sq: Tekst i Trashë

source: Italic Text
sq: Tekst i Pjerrët

source: Colored Text
sq: Tekst me Ngjyrë

source: Bullet List
sq: Listë me Pika

source: Line Break
sq: Ndërprerje e Rreshtit

# BetaWarning
source: Beta - Data may reset during updates
sq: Beta - Të dhënat mund të fshihen gjatë përditësimeve

# UnhandledError
source: An unhandled error has occurred.
sq: Ka ndodhur një gabim i paparashikuar.

source: Reload
sq: Rifresko

source: AI CV & Applications
sq: AI CV & Aplikimet

# NoProfileDataToPreview
source: No profile data available to preview.
sq: Nuk ka të dhëna të profilit të disponueshme për parapamje.

# NoProfileData
source: No profile data available.
sq: Nuk ka të dhëna të profilit të disponueshme.

source: CORE COMPETENCIES
sq: KOMPETENCAT KRYESORE

source: No skills listed.
sq: Nuk ka aftësi të listuara.

# WorkExperienceCv
source: WORK EXPERIENCE
sq: PËRVOJA E PUNËS

source: No work experience listed.
sq: Nuk ka përvojë pune të listuar.

# EducationCv
source: EDUCATION
sq: EDUKIMI

source: No education listed.
sq: Nuk ka edukim të listuar.

# PersonalProjectsCv
source: PERSONAL PROJECTS
sq: PROJEKTET PERSONALE

source: No personal projects listed.
sq: Nuk ka projekte personale të listuara.

# LanguagesCv
source: LANGUAGES
sq: GJUHËT

source: No languages listed.
sq: Nuk ka gjuhë të listuara.

# InterestsCv
source: INTERESTS
sq: INTERESAT

source: No interests listed.
sq: Nuk ka interesa të listuara.

source: References available upon request
sq: Referencat disponohen sipas kërkesës

# PhoneLabel
source: Phone:
sq: Telefoni:

# LocationLabel
source: Location:
sq: Vendndodhja:

# TechnologiesLabel
source: Technologies:
sq: Teknologjitë:

source: Show in CV
sq: Shfaq në CV

source: Will be Auto-detected
sq: Do të zbulohet automatikisht

source: Preview will appear here...
sq: Parapamja do të shfaqet këtu...

source: at
sq: në

source: Download PDF
sq: Shkarko PDF

source: No PDF Data
sq: Nuk ka të dhëna PDF

source: Preview
sq: Parapamje

source: Reset Changes
sq: Rikthe Ndryshimet

source: Edit Resume JSON
sq: Ndrysho JSON e CV-së

# EditResumeJsonHelper
source: Edit the JSON structure directly. Ensure all keys and string values are quoted.
sq: Paralajmërim: Redaktimi manual i strukturës JSON mund të rezultojë në gabime ose thyerje të pamjes paraprake nëse struktura është e pavlefshme. Përdoreni me kujdes.

source: Location
sq: Vendndodhja

source: Phone Number
sq: Numri i Telefonit

source: Description
sq: Përshkrimi

source: Role
sq: Roli

source: Section Title
sq: Titulli i Seksionit

source: Language
sq: Gjuha

source: Remove
sq: Hiqe

source: Generate
sq: Gjenero

source: My Applications
sq: Aplikimet e Mia

source: Search
sq: Kërko

source: year
sq: vit

source: years
sq: vite

source: month
sq: muaj

source: months
sq: muaj

source: Present
sq: Tani

# JobDescriptionInstructions
source: E.g., 'Focus on leadership skills', 'Use formal tone', 'Keep cover letter under 300 words'
sq: Psh., 'Fokusohuni në aftësitë udhëheqëse', 'Përdorni ton formal', 'Mbajeni letrën e motivimit nën 300 fjalë'

# RawDataWarning
source: Warning: You are editing the raw data structure. Syntax errors will prevent the CV from rendering.
sq: Paralajmërim: Ju po redaktoni strukturën e të dhënave të papërpunuara. Gabimet sintaksore do të parandalojnë renderimin e CV-së.

# EditEmailHelper
source: Edit the email if needed before copying.
sq: Ndryshoni email-in nese eshte e nevojshme para se ta kopjoni.

source: GitHub/Portfolio URL
sq: URL e GitHub/Portofolit

source: Language Name
sq: Emri i Gjuhës

source: Interest Name
sq: Emri i Interesit
